Hi Kunal,

 

I have attached both the console output and the terraform file..  Let me know what you think.  I don’t see it in the “terraform show” output.

 

Thanks again for your help.

 

Regards,

 

Jeremy Meldrum

 

 

 

From: Kunal Anand <notifications@github.com> 
Sent: Saturday, January 11, 2020 7:48 PM
To: imperva/terraform-provider-incapsula <terraform-provider-incapsula@noreply.github.com>
Cc: Jeremy Meldrum <jeremy.meldrum@venafi.com>; Mention <mention@noreply.github.com>
Subject: Re: [imperva/terraform-provider-incapsula] Unable to output the "dns_cname_record_value " when adding a site (#28)

 

Hi @jmeldrum76 [github.com] <https://urldefense.com/v3/__https:/github.com/jmeldrum76__;!!Ati4tGle!4uZLXVhtbGi2h4lvXHheDJv1pxZeB4880o08ucwV9r1hEK0Y1g0eY4yN5GuLSYY9S9M8$>  - just confirmed things are working over here as expected. Can you do me a favor and share your Terraform file? After you run apply, can you run a terraform show and share the results here?

—
You are receiving this because you were mentioned.
Reply to this email directly, view it on GitHub [github.com] <https://urldefense.com/v3/__https:/github.com/imperva/terraform-provider-incapsula/issues/28?email_source=notifications&email_token=AFB65JA4662OWDZWB67LQ23Q5KAHNA5CNFSM4KFLOECKYY3PNVWWK3TUL52HS4DFVREXG43VMVBW63LNMVXHJKTDN5WW2ZLOORPWSZGOEIWQOGY*issuecomment-573376283__;Iw!!Ati4tGle!4uZLXVhtbGi2h4lvXHheDJv1pxZeB4880o08ucwV9r1hEK0Y1g0eY4yN5GuLSZHqGDjQ$> , or unsubscribe [github.com] <https://urldefense.com/v3/__https:/github.com/notifications/unsubscribe-auth/AFB65JF3YR46RDGGXL3QWHTQ5KAHNANCNFSM4KFLOECA__;!!Ati4tGle!4uZLXVhtbGi2h4lvXHheDJv1pxZeB4880o08ucwV9r1hEK0Y1g0eY4yN5GuLSdrB-zpR$> .  <https://github.com/notifications/beacon/AFB65JE6XUAKR25EAKANRUDQ5KAHNA5CNFSM4KFLOECKYY3PNVWWK3TUL52HS4DFVREXG43VMVBW63LNMVXHJKTDN5WW2ZLOORPWSZGOEIWQOGY.gif> 


login as: venafilab
venafilab@devopslab.venafilab.com's password:
Welcome to Ubuntu 18.04.3 LTS (GNU/Linux 4.15.0-72-generic x86_64)

 * Documentation:  https://help.ubuntu.com
 * Management:     https://landscape.canonical.com
 * Support:        https://ubuntu.com/advantage


 * Canonical Livepatch is available for installation.
   - Reduce system reboots and improve kernel security. Activate at:
     https://ubuntu.com/livepatch

0 packages can be updated.
0 updates are security updates.

*** System restart required ***
Last login: Fri Jan 10 08:09:42 2020 from 192.168.114.1
venafilab@ubuntu:~$ cls

Command 'cls' not found, but there are 17 similar ones.

venafilab@ubuntu:~$ clear
venafilab@ubuntu:~$ cd terraform/Incapsula/
venafilab@ubuntu:~/terraform/Incapsula$ ll
total 20
drwxr-xr-x 3 venafilab venafilab 4096 Jan 10 10:14 ./
drwxr-xr-x 8 venafilab venafilab 4096 Jan 10 10:23 ../
-rw-r--r-- 1 venafilab venafilab 1674 Jan 10 09:46 Incapsula_Automation.tf
drwxr-xr-x 3 venafilab venafilab 4096 Jan 10 08:19 .terraform/
-rwxr--r-- 1 venafilab venafilab 3709 Jan 10 07:52 venafilab_trust_bundle.pem*
venafilab@ubuntu:~/terraform/Incapsula$ terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # incapsula_custom_certificate.custom-certificate will be created
  + resource "incapsula_custom_certificate" "custom-certificate" {
      + certificate = (known after apply)
      + id          = (known after apply)
      + passphrase  = (sensitive value)
      + private_key = (sensitive value)
      + site_id     = (known after apply)
    }

  # incapsula_site.example-site will be created
  + resource "incapsula_site" "example-site" {
      + dns_a_record_name      = (known after apply)
      + dns_a_record_value     = (known after apply)
      + dns_cname_record_name  = (known after apply)
      + dns_cname_record_value = (known after apply)
      + domain                 = "incapsulatest3.se.venafi.com"
      + id                     = (known after apply)
      + ref_id                 = "12345"
      + site_creation_date     = (known after apply)
    }

  # venafi_certificate.webserver will be created
  + resource "venafi_certificate" "webserver" {
      + algorithm         = "RSA"
      + certificate       = (known after apply)
      + certificate_dn    = (known after apply)
      + chain             = (known after apply)
      + common_name       = "incapsulatest3.se.venafi.com"
      + csr_pem           = (known after apply)
      + ecdsa_curve       = "P521"
      + expiration_window = 168
      + id                = (known after apply)
      + private_key_pem   = (known after apply)
      + rsa_bits          = 2048
      + san_dns           = [
          + "san_example.se.venafi.com",
          + "anothersan_example.se.venafi.com",
        ]
    }

Plan: 3 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


venafilab@ubuntu:~/terraform/Incapsula$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # incapsula_custom_certificate.custom-certificate will be created
  + resource "incapsula_custom_certificate" "custom-certificate" {
      + certificate = (known after apply)
      + id          = (known after apply)
      + passphrase  = (sensitive value)
      + private_key = (sensitive value)
      + site_id     = (known after apply)
    }

  # incapsula_site.example-site will be created
  + resource "incapsula_site" "example-site" {
      + dns_a_record_name      = (known after apply)
      + dns_a_record_value     = (known after apply)
      + dns_cname_record_name  = (known after apply)
      + dns_cname_record_value = (known after apply)
      + domain                 = "incapsulatest3.se.venafi.com"
      + id                     = (known after apply)
      + ref_id                 = "12345"
      + site_creation_date     = (known after apply)
    }

  # venafi_certificate.webserver will be created
  + resource "venafi_certificate" "webserver" {
      + algorithm         = "RSA"
      + certificate       = (known after apply)
      + certificate_dn    = (known after apply)
      + chain             = (known after apply)
      + common_name       = "incapsulatest3.se.venafi.com"
      + csr_pem           = (known after apply)
      + ecdsa_curve       = "P521"
      + expiration_window = 168
      + id                = (known after apply)
      + private_key_pem   = (known after apply)
      + rsa_bits          = 2048
      + san_dns           = [
          + "san_example.se.venafi.com",
          + "anothersan_example.se.venafi.com",
        ]
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

venafi_certificate.webserver: Creating...
incapsula_site.example-site: Creating...
venafi_certificate.webserver: Creation complete after 4s [id=\VED\Policy\Demo\APIs\HashiCorp Terraform\incapsulatest3.se.venafi.com]
incapsula_site.example-site: Creation complete after 7s [id=60026270]
incapsula_custom_certificate.custom-certificate: Creating...
incapsula_custom_certificate.custom-certificate: Creation complete after 2s [id=12345]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

Outputs:

Incapsula_Domain = incapsulatest3.se.venafi.com
Incapsula_Site_ID = 60026270
venafilab@ubuntu:~/terraform/Incapsula$ terraform show
# incapsula_custom_certificate.custom-certificate:
resource "incapsula_custom_certificate" "custom-certificate" {
    certificate = <<~EOT
        -----BEGIN CERTIFICATE-----
        MIIF1zCCBL+gAwIBAgITbgAAAIUCaWPUokq4ZwAAAAAAhTANBgkqhkiG9w0BAQsF
        ADBHMRMwEQYKCZImiZPyLGQBGRYDY29tMRkwFwYKCZImiZPyLGQBGRYJVmVuYWZp
        bGFiMRUwEwYDVQQDEwxWZW5hZmlMYWItQ0EwHhcNMjAwMTEzMTU0OTEwWhcNMjEw
        MTEyMTU0OTEwWjCBizELMAkGA1UEBhMCVVMxCzAJBgNVBAgTAlVUMRcwFQYDVQQH
        Ew5TYWx0IExha2UgQ2l0eTEVMBMGA1UEChMMVmVuYWZpLCBJbmMuMRgwFgYDVQQL
        Ew9BdXRvbWF0aW9uIFRlYW0xJTAjBgNVBAMTHGluY2Fwc3VsYXRlc3QzLnNlLnZl
        bmFmaS5jb20wggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQDPMMDQoAk2
        Pg/GxWn6hKyA10fAEQWrZlpaLPCYhOiSe0rRCDO9GyYtiBUJy7IGj+JDvHkF87JT
        uf8mYkwaSTE89fIDE+PRpV2yUjY/0AJp2ihAV8kRMDBN8zM1MhnBZIxVfq6EB4pQ
        8R6jXvpzNdeKsxEGNM3VXKewOmdX1yyMan3J5WIA5RPD+kwrXPXoRoqfebCLXWdE
        LKo61417u7N9rkodJUekTyjeoSoITWbCrjjwQJWHoBkvKjGuXQOuxvjfoPViRj+F
        S2TbEzRprBxp7Aql67yoyOakS9Kjt/WTAwMf9/6bmHBiHbS3YG+u1oNHWWXFqOjW
        R2nOctTD38g7AgMBAAGjggJ1MIICcTBkBgNVHREEXTBbghlzYW5fZXhhbXBsZS5z
        ZS52ZW5hZmkuY29tgiBhbm90aGVyc2FuX2V4YW1wbGUuc2UudmVuYWZpLmNvbYIc
        aW5jYXBzdWxhdGVzdDMuc2UudmVuYWZpLmNvbTAdBgNVHQ4EFgQUKukdAPWB5+hl
        zKdzwJq0WlqHbggwHwYDVR0jBBgwFoAU8ulwuhGioxpk1hbnhZKRHXzHP/owgYUG
        A1UdHwR+MHwweqB4oHaGOmh0dHA6Ly9WZW5hZmlUUFAuVmVuYWZpbGFiLmNvbS9D
        ZXJ0RW5yb2xsL1ZlbmFmaUxhYi1DQS5jcmyGOGh0dHA6Ly90cHBkZW1vLnNlLnZl
        bmFmaS5jb20vQ2VydEVucm9sbC9WZW5hZmlMYWItQ0EuY3JsMIHABggrBgEFBQcB
        AQSBszCBsDCBrQYIKwYBBQUHMAKGgaBsZGFwOi8vL0NOPVZlbmFmaUxhYi1DQSxD
        Tj1BSUEsQ049UHVibGljJTIwS2V5JTIwU2VydmljZXMsQ049U2VydmljZXMsQ049
        Q29uZmlndXJhdGlvbixEQz1WZW5hZmlsYWIsREM9Y29tP2NBQ2VydGlmaWNhdGU/
        YmFzZT9vYmplY3RDbGFzcz1jZXJ0aWZpY2F0aW9uQXV0aG9yaXR5MA4GA1UdDwEB
        /wQEAwIFoDA8BgkrBgEEAYI3FQcELzAtBiUrBgEEAYI3FQiH/LUohOaKM6WfB4fF
        ozyC4YcWAoLt2FCBkedYAgFkAgEDMBMGA1UdJQQMMAoGCCsGAQUFBwMBMBsGCSsG
        AQQBgjcVCgQOMAwwCgYIKwYBBQUHAwEwDQYJKoZIhvcNAQELBQADggEBAGbEHM/q
        c1dr9CQKHooK/6UV5DLgY8X+04MG+fszBAnTFqkU0Cltlj/Ea8nLNtfaY3c7v/dD
        qzLGsoBSP8tk/eJT/REZaXYDLtyFMbDYmp0ENyqTYVbvxIMHy6bUuMbzZ7NAEKaI
        42S2m3+P5nDdO+fj/6fS+0XIBFc9sPfekxTp2kQPV+O7rxsL1w/okLkKCiQ9NPla
        22VNYVt76rNKCljzku9Ye7Cn/50X7r4S/cErqmEx3BvFmwMFRBVIvZmup7gbbDfz
        cZfItlr4DtnqobKSI9kG4mNkfIV+fdEw2UhBDnkCrvVROyJLRx0hX99SHP9lR1ZJ
        tJoTG/S7EqwwZhc=
        -----END CERTIFICATE-----
    EOT
    id          = "12345"
    passphrase  = (sensitive value)
    private_key = (sensitive value)
    site_id     = "60026270"
}

# incapsula_site.example-site:
resource "incapsula_site" "example-site" {
    dns_a_record_value = []
    domain             = "incapsulatest3.se.venafi.com"
    id                 = "60026270"
    ref_id             = "12345"
    site_creation_date = 1578931151000
}

# venafi_certificate.webserver:
resource "venafi_certificate" "webserver" {
    algorithm         = "RSA"
    certificate       = <<~EOT
        -----BEGIN CERTIFICATE-----
        MIIF1zCCBL+gAwIBAgITbgAAAIUCaWPUokq4ZwAAAAAAhTANBgkqhkiG9w0BAQsF
        ADBHMRMwEQYKCZImiZPyLGQBGRYDY29tMRkwFwYKCZImiZPyLGQBGRYJVmVuYWZp
        bGFiMRUwEwYDVQQDEwxWZW5hZmlMYWItQ0EwHhcNMjAwMTEzMTU0OTEwWhcNMjEw
        MTEyMTU0OTEwWjCBizELMAkGA1UEBhMCVVMxCzAJBgNVBAgTAlVUMRcwFQYDVQQH
        Ew5TYWx0IExha2UgQ2l0eTEVMBMGA1UEChMMVmVuYWZpLCBJbmMuMRgwFgYDVQQL
        Ew9BdXRvbWF0aW9uIFRlYW0xJTAjBgNVBAMTHGluY2Fwc3VsYXRlc3QzLnNlLnZl
        bmFmaS5jb20wggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQDPMMDQoAk2
        Pg/GxWn6hKyA10fAEQWrZlpaLPCYhOiSe0rRCDO9GyYtiBUJy7IGj+JDvHkF87JT
        uf8mYkwaSTE89fIDE+PRpV2yUjY/0AJp2ihAV8kRMDBN8zM1MhnBZIxVfq6EB4pQ
        8R6jXvpzNdeKsxEGNM3VXKewOmdX1yyMan3J5WIA5RPD+kwrXPXoRoqfebCLXWdE
        LKo61417u7N9rkodJUekTyjeoSoITWbCrjjwQJWHoBkvKjGuXQOuxvjfoPViRj+F
        S2TbEzRprBxp7Aql67yoyOakS9Kjt/WTAwMf9/6bmHBiHbS3YG+u1oNHWWXFqOjW
        R2nOctTD38g7AgMBAAGjggJ1MIICcTBkBgNVHREEXTBbghlzYW5fZXhhbXBsZS5z
        ZS52ZW5hZmkuY29tgiBhbm90aGVyc2FuX2V4YW1wbGUuc2UudmVuYWZpLmNvbYIc
        aW5jYXBzdWxhdGVzdDMuc2UudmVuYWZpLmNvbTAdBgNVHQ4EFgQUKukdAPWB5+hl
        zKdzwJq0WlqHbggwHwYDVR0jBBgwFoAU8ulwuhGioxpk1hbnhZKRHXzHP/owgYUG
        A1UdHwR+MHwweqB4oHaGOmh0dHA6Ly9WZW5hZmlUUFAuVmVuYWZpbGFiLmNvbS9D
        ZXJ0RW5yb2xsL1ZlbmFmaUxhYi1DQS5jcmyGOGh0dHA6Ly90cHBkZW1vLnNlLnZl
        bmFmaS5jb20vQ2VydEVucm9sbC9WZW5hZmlMYWItQ0EuY3JsMIHABggrBgEFBQcB
        AQSBszCBsDCBrQYIKwYBBQUHMAKGgaBsZGFwOi8vL0NOPVZlbmFmaUxhYi1DQSxD
        Tj1BSUEsQ049UHVibGljJTIwS2V5JTIwU2VydmljZXMsQ049U2VydmljZXMsQ049
        Q29uZmlndXJhdGlvbixEQz1WZW5hZmlsYWIsREM9Y29tP2NBQ2VydGlmaWNhdGU/
        YmFzZT9vYmplY3RDbGFzcz1jZXJ0aWZpY2F0aW9uQXV0aG9yaXR5MA4GA1UdDwEB
        /wQEAwIFoDA8BgkrBgEEAYI3FQcELzAtBiUrBgEEAYI3FQiH/LUohOaKM6WfB4fF
        ozyC4YcWAoLt2FCBkedYAgFkAgEDMBMGA1UdJQQMMAoGCCsGAQUFBwMBMBsGCSsG
        AQQBgjcVCgQOMAwwCgYIKwYBBQUHAwEwDQYJKoZIhvcNAQELBQADggEBAGbEHM/q
        c1dr9CQKHooK/6UV5DLgY8X+04MG+fszBAnTFqkU0Cltlj/Ea8nLNtfaY3c7v/dD
        qzLGsoBSP8tk/eJT/REZaXYDLtyFMbDYmp0ENyqTYVbvxIMHy6bUuMbzZ7NAEKaI
        42S2m3+P5nDdO+fj/6fS+0XIBFc9sPfekxTp2kQPV+O7rxsL1w/okLkKCiQ9NPla
        22VNYVt76rNKCljzku9Ye7Cn/50X7r4S/cErqmEx3BvFmwMFRBVIvZmup7gbbDfz
        cZfItlr4DtnqobKSI9kG4mNkfIV+fdEw2UhBDnkCrvVROyJLRx0hX99SHP9lR1ZJ
        tJoTG/S7EqwwZhc=
        -----END CERTIFICATE-----
    EOT
    certificate_dn    = "\\VED\\Policy\\Demo\\APIs\\HashiCorp Terraform\\incapsulatest3.se.venafi.com"
    chain             = <<~EOT
        -----BEGIN CERTIFICATE-----
        MIIDaTCCAlGgAwIBAgIQFnSXFxdbiqdK59how61UdzANBgkqhkiG9w0BAQsFADBH
        MRMwEQYKCZImiZPyLGQBGRYDY29tMRkwFwYKCZImiZPyLGQBGRYJVmVuYWZpbGFi
        MRUwEwYDVQQDEwxWZW5hZmlMYWItQ0EwHhcNMTkxMTE1MTYwNTUxWhcNMjkxMTE1
        MTYxNTUxWjBHMRMwEQYKCZImiZPyLGQBGRYDY29tMRkwFwYKCZImiZPyLGQBGRYJ
        VmVuYWZpbGFiMRUwEwYDVQQDEwxWZW5hZmlMYWItQ0EwggEiMA0GCSqGSIb3DQEB
        AQUAA4IBDwAwggEKAoIBAQC+r2eu1QyBtqQPCNwDgmlUwXjiyfDnycsqjSB8MRfb
        T5NYsFAqMdLSl87RzkIPHmeM0VxTtMS10mJ/tdeA79rF4n5TAJrnxZwXhLO4CcDZ
        05/ZRI8lcr2B8svufW66HREyBPzDcKUX4Sg0JuNboEeHSLHL6wKJQGqaZ7/Jti5k
        n/JmATDGOHJCPToNKktuDr5fJPj6vTs2cTOm06WuwoRgcbeqjTOtvYwaef/e1zNj
        IH757cSuAWXwzc8gflkmLBV1IXO0lKK0k17yK4o8aDfPc5SQVl+En9agR8wdUSSR
        DA3+Y8nfI2ypw+29ukEpgbCZMQTv7C0yY2fx4eIoihfNAgMBAAGjUTBPMAsGA1Ud
        DwQEAwIBhjAPBgNVHRMBAf8EBTADAQH/MB0GA1UdDgQWBBTy6XC6EaKjGmTWFueF
        kpEdfMc/+jAQBgkrBgEEAYI3FQEEAwIBADANBgkqhkiG9w0BAQsFAAOCAQEAqrfp
        T/ynyokQ5iqHJYrK8LVphbAKFL30JE5SjADHVktk141rbOSgyFjbOQMqoWKVdG9s
        qQhGGH3kzqTc6YbANe1nHGIgA3hIXV4mHwz8izCPgC4sNCq4JHQGr37MmC14JfWJ
        TB+JE2VDbiWQUD58DghnE0dnz7tlfgdKs6IfB1ifLZTaveEdNId94cWHXuocMjGe
        I1I2tGnLUuNhOHdNldO6K7QaJtMpEBpMPQJbfQ2EXIJ/A3KjFycitzDcd7svrys5
        pvngMWgLv86cm4eBUCeh2xmeEEmv/iAAAgmtVwDNqclvw9rV82qa1GmJ7ArfKWAs
        m6RF9Bb8tf7QBhIXmg==
        -----END CERTIFICATE-----
    EOT
    common_name       = "incapsulatest3.se.venafi.com"
    ecdsa_curve       = "P521"
    expiration_window = 168
    id                = "\\VED\\Policy\\Demo\\APIs\\HashiCorp Terraform\\incapsulatest3.se.venafi.com"
    private_key_pem   = <<~EOT
        -----BEGIN RSA PRIVATE KEY-----
        MIIEogIBAAKCAQEAzzDA0KAJNj4PxsVp+oSsgNdHwBEFq2ZaWizwmITokntK0Qgz
        vRsmLYgVCcuyBo/iQ7x5BfOyU7n/JmJMGkkxPPXyAxPj0aVdslI2P9ACadooQFfJ
        ETAwTfMzNTIZwWSMVX6uhAeKUPEeo176czXXirMRBjTN1VynsDpnV9csjGp9yeVi
        AOUTw/pMK1z16EaKn3mwi11nRCyqOteNe7uzfa5KHSVHpE8o3qEqCE1mwq448ECV
        h6AZLyoxrl0Drsb436D1YkY/hUtk2xM0aawcaewKpeu8qMjmpEvSo7f1kwMDH/f+
        m5hwYh20t2BvrtaDR1llxajo1kdpznLUw9/IOwIDAQABAoIBACN9fGnAIBPUiatI
        waCR/WKMfdPelpQHkk6ECCp4Ccadq/EmcIZiEiYWe1QUOkh5eQ6VSD3GwrMo1xXi
        HJscEn0Yu/3e+FU++E/FWVmQ7fjnz6FF6EEzefLAR/NCw7qm2IsEiiw/hmfbBZ6C
        dHArtuIhTjc78E4t8uNy/aTETPM4M3E1nBcd0A/dvTAhJIh3rm2lK3GveMpN591B
        wFISTT3q8721dBEXddoA5U+/V31ozioqHUmsrduSNp3ZQmZ1UFeAlop5JiW59Ymv
        3Etdp9vOmsB063yAqV4FtZ5RpIvNDDFWKl4LpavGp4qUnlY4xSLoqE4EWOOsDOvx
        FkwTPYECgYEA1K0toCYXHAQuJrMLXMbo+Q/R1MkFh6i07kH2YTBfHUQrMOBXuqTy
        xbxTPn54WIx4Td5Q2F9s/mE7qb0TnOGYfqSCSKl3QgcFR3g0NZHjs8vHmAAaius9
        xM47GhsoZZA5Sw0Al4I3jWfofOvJps8urR2i7rAzyUdE5jKqym6LbGECgYEA+WV8
        Hg7v604xAhSz0tV33T2pM6wzyU9U1wl9ZDbeinPi7fxUvT0gHfVRQ94Crmq+qXaK
        0enmODdUx+JUeo5uT50zylfaJm39P9QhZtkD8gClXrz+ZL5oG54ro1MrkbYJzIsi
        637bWgdKQk16ZTM7B5Btdst3Pwcqos4KqzaZmhsCgYA4oYCTs3DV4fsUDPsKkmC4
        6VB7c6fITtEW3HOpv4KkPWGu2x4hMgj/RD16V5zeH1FtkrQ+WXKhbezALvvI+31q
        w415ob6C03HBbS2h0h4q4ylbvTNUKH3DKRMtyWuBV90ZsfWlYmQ+gBu1H+gLRgHs
        0QZwvnSbtSGQlo9J5hO0IQKBgDxHKxiYw6Q74dx+5Hew4Ke4n4y9skaVxguzX3s5
        R9Bu8gpTUqfqfji/ckTVBBDj+/E5lZPm1J4BwZwOOBznEAJuHHZrhW6EZxFmVCxn
        h2yWe2HKjDINU1xZfnKbR4yQUw39ExOYNaws1uXvlAWhvEK3xb1QsCGrucJfynRX
        XgjBAoGAaBvp7XMRCWkK/G6FZ2+C8Drg/u8OOnKky6KLyu4w0Qz1IVtQG3+//c/h
        jlhtHOm7FkOBAQwvvb3ugN3LSDR7jmIGI4WvknPDeqIdZBG6SwvT6oX6Gyi79WZv
        VTZPDcUinWh67Zs2TO+NCWhpdpCdcaf7y7B/nFi1CwQ65fopFfs=
        -----END RSA PRIVATE KEY-----
    EOT
    rsa_bits          = 2048
    san_dns           = [
        "san_example.se.venafi.com",
        "anothersan_example.se.venafi.com",
    ]
}


Outputs:

Incapsula_Domain = "incapsulatest3.se.venafi.com"
Incapsula_Site_ID = "60026270"
venafilab@ubuntu:~/terraform/Incapsula$
